Revit 2024 API
DirectShapeLibrary Properties
The DirectShapeLibrary type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DirectShapeLibrary Class
Autodesk.Revit.DB Namespace